# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка,
# стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
from random import shuffle

lst = list(range(7))
shuffle(lst)
print(f'{lst} -> {sum(lst[1::2])}')
